In [1]:
import pandas as pd
import numpy as np

In [2]:
url = 'eduPerform.csv'
df = pd.read_csv(url)
df.head(10)

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,cns,dsa,oops,os
0,NaN,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,NaN,16.0,2,20
1,M,KW,NaN,lowerlevel,G-04,A,NaN,F,Father,20.0,20.0,3,25
2,M,KW,KuwaIT,NaN,G-04,A,IT,F,Father,10.0,7.0,0,30
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,NaN,25.0,5,35
4,NaN,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40.0,50.0,12,50
5,F,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,42.0,30.0,13,70
6,M,KW,KuwaIT,MiddleSchool,G-07,A,NaN,F,Father,35.0,12.0,0,17
7,M,KW,NaN,MiddleSchool,G-07,A,Math,F,NaN,NaN,NaN,15,22
8,F,KW,KuwaIT,MiddleSchool,G-07,A,Math,F,Father,12.0,21.0,16,50
9,F,KW,KuwaIT,MiddleSchool,G-07,B,IT,F,Father,NaN,80.0,25,70

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   gender        22 non-null     object
 1   NationalITy   27 non-null     object
 2   PlaceofBirth  23 non-null     object
 3   StageID       26 non-null     object
 4   GradeID       27 non-null     object
 5   SectionID     28 non-null     object
 6   Topic         24 non-null     object
 7   Semester      28 non-null     object
 8   Relation      26 non-null     object
 9   cns           21 non-null     float64
 10  dsa           27 non-null     float64
 11  oops          28 non-null     int64
 12  os            28 non-null     int64
dtypes: float64(2), int64(2), object(9)
memory usage: 1.9+ KB

In [4]:
print(df.max(numeric_only=True))

cns     70.0
dsa     88.0
oops    44.0
os      99.0
dtype: float64

In [5]:
print(df['os'].max())

99

In [6]:
print(df.mean(numeric_only=True))

cns     25.571429
dsa     26.814815
oops    16.428571
os      53.392857
dtype: float64

In [7]:
print(df.median(numeric_only=True))

cns     20.0
dsa     19.0
oops    14.0
os      50.0
dtype: float64

In [8]:
print(df.mode())

  gender NationalITy PlaceofBirth       StageID GradeID SectionID Topic  \
0      M          KW       KuwaIT  MiddleSchool    G-07         A    IT
1    NaN         NaN          NaN           NaN     NaN       NaN   NaN
2    NaN         NaN          NaN           NaN     NaN       NaN   NaN
3    NaN         NaN          NaN           NaN     NaN       NaN   NaN
4    NaN         NaN          NaN           NaN     NaN       NaN   NaN
5    NaN         NaN          NaN           NaN     NaN       NaN   NaN

  Semester Relation   cns   dsa  oops    os
0        F   Father  10.0   7.0   0.0  50.0
1      NaN      NaN  19.0  12.0   2.0  70.0
2      NaN      NaN  20.0  15.0  12.0  80.0
3      NaN      NaN   NaN  21.0   NaN  90.0
4      NaN      NaN   NaN  30.0   NaN   NaN
5      NaN      NaN   NaN  50.0   NaN   NaN

In [9]:
df.std(numeric_only=True)

cns     20.028908
dsa     24.334270
oops    13.658340
os      28.342272
dtype: float64

In [10]:
df.var(numeric_only=True)

cns     401.157143
dsa     592.156695
oops    186.550265
os      803.284392
dtype: float64

In [11]:
df.describe()

             cns        dsa       oops         os
count  21.000000  27.000000  28.000000  28.000000
mean   25.571429  26.814815  16.428571  53.392857
std    20.028908  24.334270  13.658340  28.342272
min     0.000000   0.000000   0.000000  11.000000
25%    10.000000  12.000000   3.000000  28.750000
50%    20.000000  19.000000  14.000000  50.000000
75%    36.000000  35.000000  26.250000  80.000000
max    70.000000  88.000000  44.000000  99.000000

In [12]:
df =  df.groupby('Topic')['Topic'].count()
print(df)

Topic
Arabic     1
IT        17
Math       6
Name: Topic, dtype: int64